app/controllers/makes_controller.rb

  def index
    @makes = VehicleMake.all()
---
SELECT * FROM `vehicle_makes`