app/controllers/service_visits_controller.rb

  def index
    @service_visits = ServiceVisit.all
---
SELECT * FROM `service_visits`

  def show
    @service_visit = ServiceVisit.find(params[:id])
---
SELECT * FROM `service_visits` WHERE (`service_visits`.`id` = 1)

  def edit
    @service_visit = ServiceVisit.find(params[:id])
---
SELECT * FROM `service_visits` WHERE (`service_visits`.`id` = 1)

  def create
    @service_visit = ServiceVisit.new(params[:service_visit])

    respond_to do |format|
      if @service_visit.save
---
INSERT INTO `service_visits` (`updated_at`, `visit_date`, `description`, `vehicle_id`, `service_provider_id`, `created_at`, `mileage`) VALUES('2009-07-25 20:44:56', '2009-07-25', 'test\r\n', 1, 4, '2009-07-25 20:44:56', NULL)

  def update
    @service_visit = ServiceVisit.find(params[:id])

    respond_to do |format|
      if @service_visit.update_attributes(params[:service_visit])
---
SELECT * FROM `service_visits` WHERE (`service_visits`.`id` = 6)
UPDATE `service_visits` SET `updated_at` = '2010-02-27 22:01:54', `mileage` = 100001, `service_provider_id` = 2, `visit_date` = '2010-02-26' WHERE `id` = 6

  def find_vehicle
    @vehicle = Vehicle.find(params[:vehicle_id])
---
SELECT * FROM `vehicles` WHERE (`vehicles`.`id` = 3)