app/controllers/vehicles_controller.rb

SELECT * FROM `vehicles`
---
  def index
    @vehicles = Vehicle.all

SELECT * FROM `vehicles` WHERE (`vehicles`.`id` = 1)
---
  def show
    @vehicle = Vehicle.find(params[:id])

SELECT * FROM `vehicles` WHERE (`vehicles`.`id` = 2)
---
  def edit
    @vehicle = present Vehicle.find(params[:id])

INSERT INTO `vehicles` (`created_at`, `interior_color`, `make_id`, `updated_at`, `trim`, `vin`, `exterior_color`, `user_id`, `year`, `model_id`, `current_mileage`, `mileage_last_changed_at`, `average_mileage`) VALUES('2010-02-27 19:06:37', NULL, 40, '2010-02-27 19:06:37', NULL, NULL, NULL, NULL, 2004, 645, 40000, NULL, 100)
---
  def create
    @vehicle = Vehicle.new(params[:vehicle])

    respond_to do |format|
      if @vehicle.save

SELECT * FROM `vehicles` WHERE (`vehicles`.`id` = 2)
UPDATE `vehicles` SET `average_mileage` = 40, `updated_at` = '2009-08-02 21:21:33', `current_mileage` = 39000 WHERE `id` = 2
---
  def update
    @vehicle = Vehicle.find(params[:id])

    respond_to do |format|
      if @vehicle.update_attributes(params[:vehicle])